k6_pbf_crud/app/Controllers/Home.php

    public function sewa($id=null)
    {
        $sewaModel = new SewaModel(); // Create instance of SewaModel
        $data = [
            'title' => 'Sewa Mobil',
            'isi_sewa' => $sewaModel->orderBy('sewaId DESC')->findAll(),
            // Retrieve data from database
            'sewa_obj' => $sewaModel->where('sewaId', $id)->first()
---
SELECT *
FROM `tb_sewa`
ORDER BY `sewaId` DESC
SELECT *
FROM `tb_sewa`
WHERE `sewaId` IS NULL
 LIMIT 1