app/Controllers/Home.php

SELECT *
FROM `tb_sewa`
WHERE `sewaId` IS NULL
 LIMIT 1
SELECT *
FROM `tb_sewa`
ORDER BY `sewaId` DESC
---
    public function sewa()
    {
        $sewaModel = new SewaModel(); // Create instance of SewaModel
        $data = [
            'title' => 'Sewa Mobil',
            'isi_sewa' => $sewaModel->findAll(), // Retrieve data from database
        ];